ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMA_example/S12ZVMAL32/S12ZVMAL32_LIN_Slave/Project_Headers/mc9s12zvmal32.h
/*** PPSE - Port E Polarity Select Register; 0x00000268 ***/
typedef union {
  byte Byte;
  struct {
    byte PPSE0       :1;                                       /* Port E pull polarity select 0 */
    byte PPSE1       :1;                                       /* Port E pull polarity select 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPPSE :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PPSESTR;
extern volatile PPSESTR _PPSE @0x00000268;
#define PPSE                            _PPSE.Byte
#define PPSE_PPSE0                      _PPSE.Bits.PPSE0
#define PPSE_PPSE1                      _PPSE.Bits.PPSE1
#define PPSE_PPSE                       _PPSE.MergedBits.grpPPSE

#define PPSE_PPSE0_MASK                 1U
#define PPSE_PPSE1_MASK                 2U
#define PPSE_PPSE_MASK                  3U
#define PPSE_PPSE_BITNUM                0U


/*** PTADL - Port ADL Data Register; 0x00000281 ***/
typedef union {
  byte Byte;
  struct {
    byte PTADL0      :1;                                       /* Port ADL general purpose I/O data 0 */
    byte PTADL1      :1;                                       /* Port ADL general purpose I/O data 1 */
    byte PTADL2      :1;                                       /* Port ADL general purpose I/O data 2 */
    byte PTADL3      :1;                                       /* Port ADL general purpose I/O data 3 */
    byte PTADL4      :1;                                       /* Port ADL general purpose I/O data 4 */
    byte PTADL5      :1;                                       /* Port ADL general purpose I/O data 5 */
    byte PTADL6      :1;                                       /* Port ADL general purpose I/O data 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTADL :7;
    byte         :1;
  } MergedBits;
} PTADLSTR;
extern volatile PTADLSTR _PTADL @0x00000281;
#define PTADL                           _PTADL.Byte
#define PTADL_PTADL0                    _PTADL.Bits.PTADL0
#define PTADL_PTADL1                    _PTADL.Bits.PTADL1
#define PTADL_PTADL2                    _PTADL.Bits.PTADL2
#define PTADL_PTADL3                    _PTADL.Bits.PTADL3
#define PTADL_PTADL4                    _PTADL.Bits.PTADL4
#define PTADL_PTADL5                    _PTADL.Bits.PTADL5
#define PTADL_PTADL6                    _PTADL.Bits.PTADL6
#define PTADL_PTADL                     _PTADL.MergedBits.grpPTADL

#define PTADL_PTADL0_MASK               1U
#define PTADL_PTADL1_MASK               2U
#define PTADL_PTADL2_MASK               4U
#define PTADL_PTADL3_MASK               8U
#define PTADL_PTADL4_MASK               16U
#define PTADL_PTADL5_MASK               32U
#define PTADL_PTADL6_MASK               64U
#define PTADL_PTADL_MASK                127U
#define PTADL_PTADL_BITNUM              0U


/*** PTIADL - Port ADL Input Register; 0x00000283 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIADL0     :1;                                       /* Port ADL data input 0 */
    byte PTIADL1     :1;                                       /* Port ADL data input 1 */
    byte PTIADL2     :1;                                       /* Port ADL data input 2 */
    byte PTIADL3     :1;                                       /* Port ADL data input 3 */
    byte PTIADL4     :1;                                       /* Port ADL data input 4 */
    byte PTIADL5     :1;                                       /* Port ADL data input 5 */
    byte PTIADL6     :1;                                       /* Port ADL data input 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTIADL :7;
    byte         :1;
  } MergedBits;
} PTIADLSTR;
extern volatile PTIADLSTR _PTIADL @0x00000283;
#define PTIADL                          _PTIADL.Byte
#define PTIADL_PTIADL0                  _PTIADL.Bits.PTIADL0
#define PTIADL_PTIADL1                  _PTIADL.Bits.PTIADL1
#define PTIADL_PTIADL2                  _PTIADL.Bits.PTIADL2
#define PTIADL_PTIADL3                  _PTIADL.Bits.PTIADL3
#define PTIADL_PTIADL4                  _PTIADL.Bits.PTIADL4
#define PTIADL_PTIADL5                  _PTIADL.Bits.PTIADL5
#define PTIADL_PTIADL6                  _PTIADL.Bits.PTIADL6
#define PTIADL_PTIADL                   _PTIADL.MergedBits.grpPTIADL

#define PTIADL_PTIADL0_MASK             1U
#define PTIADL_PTIADL1_MASK             2U
#define PTIADL_PTIADL2_MASK             4U
#define PTIADL_PTIADL3_MASK             8U
#define PTIADL_PTIADL4_MASK             16U
#define PTIADL_PTIADL5_MASK             32U
#define PTIADL_PTIADL6_MASK             64U
#define PTIADL_PTIADL_MASK              127U
#define PTIADL_PTIADL_BITNUM            0U


/*** DDRADL - Port ADL Data Direction Register; 0x00000285 ***/
typedef union {
  byte Byte;
  struct {
    byte DDRADL0     :1;                                       /* Port ADL data direction select 0 */
    byte DDRADL1     :1;                                       /* Port ADL data direction select 1 */
    byte DDRADL2     :1;                                       /* Port ADL data direction select 2 */
    byte DDRADL3     :1;                                       /* Port ADL data direction select 3 */
    byte DDRADL4     :1;                                       /* Port ADL data direction select 4 */
    byte DDRADL5     :1;                                       /* Port ADL data direction select 5 */
    byte DDRADL6     :1;                                       /* Port ADL data direction select 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpDDRADL :7;
    byte         :1;
  } MergedBits;
} DDRADLSTR;
extern volatile DDRADLSTR _DDRADL @0x00000285;
#define DDRADL                          _DDRADL.Byte
#define DDRADL_DDRADL0                  _DDRADL.Bits.DDRADL0
#define DDRADL_DDRADL1                  _DDRADL.Bits.DDRADL1
#define DDRADL_DDRADL2                  _DDRADL.Bits.DDRADL2
#define DDRADL_DDRADL3                  _DDRADL.Bits.DDRADL3
#define DDRADL_DDRADL4                  _DDRADL.Bits.DDRADL4
#define DDRADL_DDRADL5                  _DDRADL.Bits.DDRADL5
#define DDRADL_DDRADL6                  _DDRADL.Bits.DDRADL6
#define DDRADL_DDRADL                   _DDRADL.MergedBits.grpDDRADL

#define DDRADL_DDRADL0_MASK             1U
#define DDRADL_DDRADL1_MASK             2U
#define DDRADL_DDRADL2_MASK             4U
#define DDRADL_DDRADL3_MASK             8U
#define DDRADL_DDRADL4_MASK             16U
#define DDRADL_DDRADL5_MASK             32U
#define DDRADL_DDRADL6_MASK             64U
#define DDRADL_DDRADL_MASK              127U
#define DDRADL_DDRADL_BITNUM            0U


/*** PERADL - Port ADL Pull Device Enable Register; 0x00000287 ***/
typedef union {
  byte Byte;
  struct {
    byte PERADL0     :1;                                       /* Port ADL pull device enable 0 */
    byte PERADL1     :1;                                       /* Port ADL pull device enable 1 */
    byte PERADL2     :1;                                       /* Port ADL pull device enable 2 */
    byte PERADL3     :1;                                       /* Port ADL pull device enable 3 */
    byte PERADL4     :1;                                       /* Port ADL pull device enable 4 */
    byte PERADL5     :1;                                       /* Port ADL pull device enable 5 */
    byte PERADL6     :1;                                       /* Port ADL pull device enable 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPERADL :7;
    byte         :1;
  } MergedBits;
} PERADLSTR;
