ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMA_example/S12ZVMAL32/S12ZVMAL32_LIN_Slave/Project_Headers/mc9s12zvmal32.h
extern volatile PERADLSTR _PERADL @0x00000287;
#define PERADL                          _PERADL.Byte
#define PERADL_PERADL0                  _PERADL.Bits.PERADL0
#define PERADL_PERADL1                  _PERADL.Bits.PERADL1
#define PERADL_PERADL2                  _PERADL.Bits.PERADL2
#define PERADL_PERADL3                  _PERADL.Bits.PERADL3
#define PERADL_PERADL4                  _PERADL.Bits.PERADL4
#define PERADL_PERADL5                  _PERADL.Bits.PERADL5
#define PERADL_PERADL6                  _PERADL.Bits.PERADL6
#define PERADL_PERADL                   _PERADL.MergedBits.grpPERADL

#define PERADL_PERADL0_MASK             1U
#define PERADL_PERADL1_MASK             2U
#define PERADL_PERADL2_MASK             4U
#define PERADL_PERADL3_MASK             8U
#define PERADL_PERADL4_MASK             16U
#define PERADL_PERADL5_MASK             32U
#define PERADL_PERADL6_MASK             64U
#define PERADL_PERADL_MASK              127U
#define PERADL_PERADL_BITNUM            0U


/*** PPSADL - Port ADL Polarity Select Register; 0x00000289 ***/
typedef union {
  byte Byte;
  struct {
    byte PPSADL0     :1;                                       /* Port ADL pull polarity select 0 */
    byte PPSADL1     :1;                                       /* Port ADL pull polarity select 1 */
    byte PPSADL2     :1;                                       /* Port ADL pull polarity select 2 */
    byte PPSADL3     :1;                                       /* Port ADL pull polarity select 3 */
    byte PPSADL4     :1;                                       /* Port ADL pull polarity select 4 */
    byte PPSADL5     :1;                                       /* Port ADL pull polarity select 5 */
    byte PPSADL6     :1;                                       /* Port ADL pull polarity select 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPPSADL :7;
    byte         :1;
  } MergedBits;
} PPSADLSTR;
extern volatile PPSADLSTR _PPSADL @0x00000289;
#define PPSADL                          _PPSADL.Byte
#define PPSADL_PPSADL0                  _PPSADL.Bits.PPSADL0
#define PPSADL_PPSADL1                  _PPSADL.Bits.PPSADL1
#define PPSADL_PPSADL2                  _PPSADL.Bits.PPSADL2
#define PPSADL_PPSADL3                  _PPSADL.Bits.PPSADL3
#define PPSADL_PPSADL4                  _PPSADL.Bits.PPSADL4
#define PPSADL_PPSADL5                  _PPSADL.Bits.PPSADL5
#define PPSADL_PPSADL6                  _PPSADL.Bits.PPSADL6
#define PPSADL_PPSADL                   _PPSADL.MergedBits.grpPPSADL

#define PPSADL_PPSADL0_MASK             1U
#define PPSADL_PPSADL1_MASK             2U
#define PPSADL_PPSADL2_MASK             4U
#define PPSADL_PPSADL3_MASK             8U
#define PPSADL_PPSADL4_MASK             16U
#define PPSADL_PPSADL5_MASK             32U
#define PPSADL_PPSADL6_MASK             64U
#define PPSADL_PPSADL_MASK              127U
#define PPSADL_PPSADL_BITNUM            0U


/*** PIEADL - Port ADL Interrupt Enable Register; 0x0000028D ***/
typedef union {
  byte Byte;
  struct {
    byte PIEADL0     :1;                                       /* Port ADL interrupt enable 0 */
    byte PIEADL1     :1;                                       /* Port ADL interrupt enable 1 */
    byte PIEADL2     :1;                                       /* Port ADL interrupt enable 2 */
    byte PIEADL3     :1;                                       /* Port ADL interrupt enable 3 */
    byte PIEADL4     :1;                                       /* Port ADL interrupt enable 4 */
    byte PIEADL5     :1;                                       /* Port ADL interrupt enable 5 */
    byte PIEADL6     :1;                                       /* Port ADL interrupt enable 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPIEADL :7;
    byte         :1;
  } MergedBits;
} PIEADLSTR;
extern volatile PIEADLSTR _PIEADL @0x0000028D;
#define PIEADL                          _PIEADL.Byte
#define PIEADL_PIEADL0                  _PIEADL.Bits.PIEADL0
#define PIEADL_PIEADL1                  _PIEADL.Bits.PIEADL1
#define PIEADL_PIEADL2                  _PIEADL.Bits.PIEADL2
#define PIEADL_PIEADL3                  _PIEADL.Bits.PIEADL3
#define PIEADL_PIEADL4                  _PIEADL.Bits.PIEADL4
#define PIEADL_PIEADL5                  _PIEADL.Bits.PIEADL5
#define PIEADL_PIEADL6                  _PIEADL.Bits.PIEADL6
#define PIEADL_PIEADL                   _PIEADL.MergedBits.grpPIEADL

#define PIEADL_PIEADL0_MASK             1U
#define PIEADL_PIEADL1_MASK             2U
#define PIEADL_PIEADL2_MASK             4U
#define PIEADL_PIEADL3_MASK             8U
#define PIEADL_PIEADL4_MASK             16U
#define PIEADL_PIEADL5_MASK             32U
#define PIEADL_PIEADL6_MASK             64U
#define PIEADL_PIEADL_MASK              127U
#define PIEADL_PIEADL_BITNUM            0U


/*** PIFADL - Port ADL Interrupt Flag Register; 0x0000028F ***/
typedef union {
  byte Byte;
  struct {
    byte PIFADL0     :1;                                       /* Port ADL interrupt flag 0 */
    byte PIFADL1     :1;                                       /* Port ADL interrupt flag 1 */
    byte PIFADL2     :1;                                       /* Port ADL interrupt flag 2 */
    byte PIFADL3     :1;                                       /* Port ADL interrupt flag 3 */
    byte PIFADL4     :1;                                       /* Port ADL interrupt flag 4 */
    byte PIFADL5     :1;                                       /* Port ADL interrupt flag 5 */
    byte PIFADL6     :1;                                       /* Port ADL interrupt flag 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPIFADL :7;
    byte         :1;
  } MergedBits;
} PIFADLSTR;
extern volatile PIFADLSTR _PIFADL @0x0000028F;
#define PIFADL                          _PIFADL.Byte
#define PIFADL_PIFADL0                  _PIFADL.Bits.PIFADL0
#define PIFADL_PIFADL1                  _PIFADL.Bits.PIFADL1
#define PIFADL_PIFADL2                  _PIFADL.Bits.PIFADL2
#define PIFADL_PIFADL3                  _PIFADL.Bits.PIFADL3
#define PIFADL_PIFADL4                  _PIFADL.Bits.PIFADL4
#define PIFADL_PIFADL5                  _PIFADL.Bits.PIFADL5
#define PIFADL_PIFADL6                  _PIFADL.Bits.PIFADL6
#define PIFADL_PIFADL                   _PIFADL.MergedBits.grpPIFADL

#define PIFADL_PIFADL0_MASK             1U
#define PIFADL_PIFADL1_MASK             2U
#define PIFADL_PIFADL2_MASK             4U
#define PIFADL_PIFADL3_MASK             8U
#define PIFADL_PIFADL4_MASK             16U
#define PIFADL_PIFADL5_MASK             32U
#define PIFADL_PIFADL6_MASK             64U
#define PIFADL_PIFADL_MASK              127U
#define PIFADL_PIFADL_BITNUM            0U


/*** DIENADL - Digital Input Enable Register; 0x00000299 ***/
typedef union {
  byte Byte;
  struct {
    byte DIENADL0    :1;                                       /* Digital input enable 0 */
    byte DIENADL1    :1;                                       /* Digital input enable 1 */
    byte DIENADL2    :1;                                       /* Digital input enable 2 */
    byte DIENADL3    :1;                                       /* Digital input enable 3 */
    byte DIENADL4    :1;                                       /* Digital input enable 4 */
    byte DIENADL5    :1;                                       /* Digital input enable 5 */
    byte DIENADL6    :1;                                       /* Digital input enable 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpDIENADL :7;
    byte         :1;
  } MergedBits;
} DIENADLSTR;
extern volatile DIENADLSTR _DIENADL @0x00000299;
#define DIENADL                         _DIENADL.Byte
#define DIENADL_DIENADL0                _DIENADL.Bits.DIENADL0
#define DIENADL_DIENADL1                _DIENADL.Bits.DIENADL1
#define DIENADL_DIENADL2                _DIENADL.Bits.DIENADL2
#define DIENADL_DIENADL3                _DIENADL.Bits.DIENADL3
#define DIENADL_DIENADL4                _DIENADL.Bits.DIENADL4
#define DIENADL_DIENADL5                _DIENADL.Bits.DIENADL5
#define DIENADL_DIENADL6                _DIENADL.Bits.DIENADL6
#define DIENADL_DIENADL                 _DIENADL.MergedBits.grpDIENADL

