ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMA_example/S12ZVMAL32/S12ZVMAL32_LIN_Slave/Project_Headers/mc9s12zvmal32.h
#define PMFENCC_PWMRIEC_MASK            1U
#define PMFENCC_LDOKC_MASK              2U
#define PMFENCC_RSTRTC_MASK             4U
#define PMFENCC_GLDOKC_MASK             64U
#define PMFENCC_PWMENC_MASK             128U


/*** PMFFQCC - PMF Frequency Control C Register; 0x00000531 ***/
typedef union {
  byte Byte;
  struct {
    byte PWMRFC      :1;                                       /* PWM Reload Interrupt Flag C */
    byte PRSCC       :2;                                       /* Prescaler C */
    byte HALFC       :1;                                       /* Half Cycle Reload B */
    byte LDFQC       :4;                                       /* Load Frequency C */
  } Bits;
} PMFFQCCSTR;
extern volatile PMFFQCCSTR _PMFFQCC @0x00000531;
#define PMFFQCC                         _PMFFQCC.Byte
#define PMFFQCC_PWMRFC                  _PMFFQCC.Bits.PWMRFC
#define PMFFQCC_PRSCC                   _PMFFQCC.Bits.PRSCC
#define PMFFQCC_HALFC                   _PMFFQCC.Bits.HALFC
#define PMFFQCC_LDFQC                   _PMFFQCC.Bits.LDFQC

#define PMFFQCC_PWMRFC_MASK             1U
#define PMFFQCC_PRSCC_MASK              6U
#define PMFFQCC_PRSCC_BITNUM            1U
#define PMFFQCC_HALFC_MASK              8U
#define PMFFQCC_LDFQC_MASK              240U
#define PMFFQCC_LDFQC_BITNUM            4U


/*** PMFCNTC - PMF counter C Register; 0x00000532 ***/
typedef union {
  word Word;
  struct {
    word PMFCNTC_grp :15;                                      /* PMF counter */ /*Warning: group name is duplicated with register name*/
    word             :1; 
  } Bits;
} PMFCNTCSTR;
extern volatile PMFCNTCSTR _PMFCNTC @0x00000532;
#define PMFCNTC                         _PMFCNTC.Word
#define PMFCNTC_PMFCNTC                 _PMFCNTC.Bits.PMFCNTC_grp

#define PMFCNTC_PMFCNTC_MASK            32767U
#define PMFCNTC_PMFCNTC_BITNUM          0U


/*** PMFMODC - PMF modulo counter C Register; 0x00000534 ***/
typedef union {
  word Word;
  struct {
    word PMFMODC_grp :15;                                      /* PMF modulo counter */ /*Warning: group name is duplicated with register name*/
    word             :1; 
  } Bits;
} PMFMODCSTR;
extern volatile PMFMODCSTR _PMFMODC @0x00000534;
#define PMFMODC                         _PMFMODC.Word
#define PMFMODC_PMFMODC                 _PMFMODC.Bits.PMFMODC_grp

#define PMFMODC_PMFMODC_MASK            32767U
#define PMFMODC_PMFMODC_BITNUM          0U


/*** PMFDTMC - PMF deadtime C Register; 0x00000536 ***/
typedef union {
  word Word;
  struct {
    word PMFDTMC_grp :12;                                      /* PMF Value 0 */ /*Warning: group name is duplicated with register name*/
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
} PMFDTMCSTR;
extern volatile PMFDTMCSTR _PMFDTMC @0x00000536;
#define PMFDTMC                         _PMFDTMC.Word
#define PMFDTMC_PMFDTMC                 _PMFDTMC.Bits.PMFDTMC_grp

#define PMFDTMC_PMFDTMC_MASK            4095U
#define PMFDTMC_PMFDTMC_BITNUM          0U


/*** PMFDMP0 - PMF Disable Mapping Register 0; 0x00000538 ***/
typedef union {
  byte Byte;
  struct {
    byte DMP00       :1;                                       /* PWM Disable Mapping Channel 0 FAULT0 */
    byte DMP01       :1;                                       /* PWM Disable Mapping Channel 0 FAULT1 */
    byte DMP02       :1;                                       /* PWM Disable Mapping Channel 0 FAULT2 */
    byte DMP03       :1;                                       /* PWM Disable Mapping Channel 0 FAULT3 */
    byte DMP04       :2;                                       /* PWM Disable Mapping Channel 0 FAULT4 */
    byte DMP05       :2;                                       /* PWM Disable Mapping Channel 0 FAULT5 */
  } Bits;
  struct {
    byte grpDMP0 :4;
    byte         :2;
    byte         :2;
  } MergedBits;
} PMFDMP0STR;
extern volatile PMFDMP0STR _PMFDMP0 @0x00000538;
#define PMFDMP0                         _PMFDMP0.Byte
#define PMFDMP0_DMP00                   _PMFDMP0.Bits.DMP00
#define PMFDMP0_DMP01                   _PMFDMP0.Bits.DMP01
#define PMFDMP0_DMP02                   _PMFDMP0.Bits.DMP02
#define PMFDMP0_DMP03                   _PMFDMP0.Bits.DMP03
#define PMFDMP0_DMP04                   _PMFDMP0.Bits.DMP04
#define PMFDMP0_DMP05                   _PMFDMP0.Bits.DMP05
/* PMFDMP_ARR: Access 6 PMFDMPx registers in an array */
#define PMFDMP_ARR                      ((volatile byte *) &PMFDMP0)
#define PMFDMP0_DMP0                    _PMFDMP0.MergedBits.grpDMP0

#define PMFDMP0_DMP00_MASK              1U
#define PMFDMP0_DMP01_MASK              2U
#define PMFDMP0_DMP02_MASK              4U
#define PMFDMP0_DMP03_MASK              8U
#define PMFDMP0_DMP04_MASK              48U
#define PMFDMP0_DMP04_BITNUM            4U
#define PMFDMP0_DMP05_MASK              192U
#define PMFDMP0_DMP05_BITNUM            6U
#define PMFDMP0_DMP0_MASK               15U
#define PMFDMP0_DMP0_BITNUM             0U


/*** PMFDMP1 - PMF Disable Mapping Register 1; 0x00000539 ***/
typedef union {
  byte Byte;
  struct {
    byte DMP10       :1;                                       /* PWM Disable Mapping Channel 1 FAULT0 */
    byte DMP11       :1;                                       /* PWM Disable Mapping Channel 1 FAULT1 */
    byte DMP12       :1;                                       /* PWM Disable Mapping Channel 1 FAULT2 */
    byte DMP13       :1;                                       /* PWM Disable Mapping Channel 1 FAULT3 */
    byte DMP14       :2;                                       /* PWM Disable Mapping Channel 1 FAULT4 */
    byte DMP15       :2;                                       /* PWM Disable Mapping Channel 1 FAULT5 */
  } Bits;
  struct {
    byte grpDMP_10 :4;
    byte         :2;
    byte         :2;
  } MergedBits;
} PMFDMP1STR;
extern volatile PMFDMP1STR _PMFDMP1 @0x00000539;
#define PMFDMP1                         _PMFDMP1.Byte
#define PMFDMP1_DMP10                   _PMFDMP1.Bits.DMP10
#define PMFDMP1_DMP11                   _PMFDMP1.Bits.DMP11
#define PMFDMP1_DMP12                   _PMFDMP1.Bits.DMP12
#define PMFDMP1_DMP13                   _PMFDMP1.Bits.DMP13
#define PMFDMP1_DMP14                   _PMFDMP1.Bits.DMP14
#define PMFDMP1_DMP15                   _PMFDMP1.Bits.DMP15
#define PMFDMP1_DMP_10                  _PMFDMP1.MergedBits.grpDMP_10
#define PMFDMP1_DMP                     PMFDMP1_DMP_10

#define PMFDMP1_DMP10_MASK              1U
#define PMFDMP1_DMP11_MASK              2U
#define PMFDMP1_DMP12_MASK              4U
#define PMFDMP1_DMP13_MASK              8U
#define PMFDMP1_DMP14_MASK              48U
#define PMFDMP1_DMP14_BITNUM            4U
#define PMFDMP1_DMP15_MASK              192U
#define PMFDMP1_DMP15_BITNUM            6U
#define PMFDMP1_DMP_10_MASK             15U
#define PMFDMP1_DMP_10_BITNUM           0U


/*** PMFDMP2 - PMF Disable Mapping Register 2; 0x0000053A ***/
typedef union {
  byte Byte;
  struct {
    byte DMP20       :1;                                       /* PWM Disable Mapping Channel 2 FAULT0 */
    byte DMP21       :1;                                       /* PWM Disable Mapping Channel 2 FAULT1 */
    byte DMP22       :1;                                       /* PWM Disable Mapping Channel 2 FAULT2 */
    byte DMP23       :1;                                       /* PWM Disable Mapping Channel 2 FAULT3 */
    byte DMP24       :2;                                       /* PWM Disable Mapping Channel 2 FAULT4 */
    byte DMP25       :2;                                       /* PWM Disable Mapping Channel 2 FAULT5 */
  } Bits;
  struct {
    byte grpDMP_20 :4;
    byte         :2;
    byte         :2;
  } MergedBits;
} PMFDMP2STR;
extern volatile PMFDMP2STR _PMFDMP2 @0x0000053A;
#define PMFDMP2                         _PMFDMP2.Byte
#define PMFDMP2_DMP20                   _PMFDMP2.Bits.DMP20
#define PMFDMP2_DMP21                   _PMFDMP2.Bits.DMP21
#define PMFDMP2_DMP22                   _PMFDMP2.Bits.DMP22
#define PMFDMP2_DMP23                   _PMFDMP2.Bits.DMP23
#define PMFDMP2_DMP24                   _PMFDMP2.Bits.DMP24
#define PMFDMP2_DMP25                   _PMFDMP2.Bits.DMP25
#define PMFDMP2_DMP_20                  _PMFDMP2.MergedBits.grpDMP_20
#define PMFDMP2_DMP                     PMFDMP2_DMP_20

#define PMFDMP2_DMP20_MASK              1U
#define PMFDMP2_DMP21_MASK              2U
#define PMFDMP2_DMP22_MASK              4U
#define PMFDMP2_DMP23_MASK              8U
#define PMFDMP2_DMP24_MASK              48U
#define PMFDMP2_DMP24_BITNUM            4U
#define PMFDMP2_DMP25_MASK              192U
#define PMFDMP2_DMP25_BITNUM            6U
#define PMFDMP2_DMP_20_MASK             15U
#define PMFDMP2_DMP_20_BITNUM           0U


/*** PMFDMP3 - PMF Disable Mapping Register 3; 0x0000053B ***/
typedef union {
  byte Byte;
  struct {
    byte DMP30       :1;                                       /* PWM Disable Mapping Channel 3 FAULT0 */
    byte DMP31       :1;                                       /* PWM Disable Mapping Channel 3 FAULT1 */
    byte DMP32       :1;                                       /* PWM Disable Mapping Channel 3 FAULT2 */
    byte DMP33       :1;                                       /* PWM Disable Mapping Channel 3 FAULT3 */
    byte DMP34       :2;                                       /* PWM Disable Mapping Channel 3 FAULT4 */
    byte DMP35       :2;                                       /* PWM Disable Mapping Channel 3 FAULT5 */
  } Bits;
  struct {
    byte grpDMP_30 :4;
    byte         :2;
    byte         :2;
  } MergedBits;
} PMFDMP3STR;
extern volatile PMFDMP3STR _PMFDMP3 @0x0000053B;
#define PMFDMP3                         _PMFDMP3.Byte
#define PMFDMP3_DMP30                   _PMFDMP3.Bits.DMP30
#define PMFDMP3_DMP31                   _PMFDMP3.Bits.DMP31
#define PMFDMP3_DMP32                   _PMFDMP3.Bits.DMP32
#define PMFDMP3_DMP33                   _PMFDMP3.Bits.DMP33
#define PMFDMP3_DMP34                   _PMFDMP3.Bits.DMP34
#define PMFDMP3_DMP35                   _PMFDMP3.Bits.DMP35
#define PMFDMP3_DMP_30                  _PMFDMP3.MergedBits.grpDMP_30
#define PMFDMP3_DMP                     PMFDMP3_DMP_30

#define PMFDMP3_DMP30_MASK              1U
#define PMFDMP3_DMP31_MASK              2U
#define PMFDMP3_DMP32_MASK              4U
#define PMFDMP3_DMP33_MASK              8U
#define PMFDMP3_DMP34_MASK              48U
#define PMFDMP3_DMP34_BITNUM            4U
#define PMFDMP3_DMP35_MASK              192U
#define PMFDMP3_DMP35_BITNUM            6U
#define PMFDMP3_DMP_30_MASK             15U
#define PMFDMP3_DMP_30_BITNUM           0U


/*** PMFDMP4 - PMF Disable Mapping Register 4; 0x0000053C ***/
typedef union {
  byte Byte;
  struct {
    byte DMP40       :1;                                       /* PWM Disable Mapping Channel 4 FAULT0 */
    byte DMP41       :1;                                       /* PWM Disable Mapping Channel 4 FAULT1 */
    byte DMP42       :1;                                       /* PWM Disable Mapping Channel 4 FAULT2 */
    byte DMP43       :1;                                       /* PWM Disable Mapping Channel 4 FAULT3 */
    byte DMP44       :2;                                       /* PWM Disable Mapping Channel 4 FAULT4 */
    byte DMP45       :2;                                       /* PWM Disable Mapping Channel 4 FAULT5 */
  } Bits;
  struct {
    byte grpDMP_40 :4;
    byte         :2;
    byte         :2;
  } MergedBits;
} PMFDMP4STR;
