ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMA_example/S12ZVMAL32/S12ZVMAL32_LIN_Slave/Project_Headers/mc9s12zvmal32.h
/*** PTUIFH - PTU Interrupt Flag Register High; 0x00000584 ***/
typedef union {
  byte Byte;
  struct {
    byte PTUROIF     :1;                                       /* PTU Reload Overrun Interrupt Flag */
    byte PTUDEEF     :1;                                       /* PTU Double bit ECC Error Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} PTUIFHSTR;
extern volatile PTUIFHSTR _PTUIFH @0x00000584;
#define PTUIFH                          _PTUIFH.Byte
#define PTUIFH_PTUROIF                  _PTUIFH.Bits.PTUROIF
#define PTUIFH_PTUDEEF                  _PTUIFH.Bits.PTUDEEF

#define PTUIFH_PTUROIF_MASK             1U
#define PTUIFH_PTUDEEF_MASK             2U


/*** PTUIFL - PTU Interrupt Flag Register Low; 0x00000585 ***/
typedef union {
  byte Byte;
  struct {
    byte TG0DIF      :1;                                       /* Trigger Generator 0 Done Interrupt Flag */
    byte TG0EIF      :1;                                       /* Trigger Generator 0 Timing Error Interrupt Flag */
    byte TG0REIF     :1;                                       /* Trigger Generator 0 Reload Error Interrupt Flag */
    byte TG0AEIF     :1;                                       /* Trigger Generator 0 Memory Access Error Interrupt Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} PTUIFLSTR;
extern volatile PTUIFLSTR _PTUIFL @0x00000585;
#define PTUIFL                          _PTUIFL.Byte
#define PTUIFL_TG0DIF                   _PTUIFL.Bits.TG0DIF
#define PTUIFL_TG0EIF                   _PTUIFL.Bits.TG0EIF
#define PTUIFL_TG0REIF                  _PTUIFL.Bits.TG0REIF
#define PTUIFL_TG0AEIF                  _PTUIFL.Bits.TG0AEIF

#define PTUIFL_TG0DIF_MASK              1U
#define PTUIFL_TG0EIF_MASK              2U
#define PTUIFL_TG0REIF_MASK             4U
#define PTUIFL_TG0AEIF_MASK             8U


/*** TG0LIST - Trigger Generator 0 List Register; 0x00000586 ***/
typedef union {
  byte Byte;
  struct {
    byte TG0LIST_bit :1;                                       /* Trigger Generator 0 List */ /*Warning: bit name is duplicated with register name*/
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} TG0LISTSTR;
extern volatile TG0LISTSTR _TG0LIST @0x00000586;
#define TG0LIST                         _TG0LIST.Byte
#define TG0LIST_TG0LIST                 _TG0LIST.Bits.TG0LIST_bit

#define TG0LIST_TG0LIST_MASK            1U


/*** TG0TNUM - Trigger Generator 0 Trigger Number Register; 0x00000587 ***/
typedef union {
  byte Byte;
  struct {
    byte TG0TNUM_grp :5;                                       /* Trigger Generator 0 Trigger Number */ /*Warning: group name is duplicated with register name*/
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} TG0TNUMSTR;
extern volatile TG0TNUMSTR _TG0TNUM @0x00000587;
#define TG0TNUM                         _TG0TNUM.Byte
#define TG0TNUM_TG0TNUM                 _TG0TNUM.Bits.TG0TNUM_grp

#define TG0TNUM_TG0TNUM_MASK            31U
#define TG0TNUM_TG0TNUM_BITNUM          0U


/*** TG0TVH - Trigger Generator 0 Trigger Value; 0x00000588 ***/
typedef union {
  byte Byte;
} TG0TVHSTR;
extern volatile TG0TVHSTR _TG0TVH @0x00000588;
#define TG0TVH                          _TG0TVH.Byte


/*** TG0TVL - Trigger Generator 0 Trigger Value; 0x00000589 ***/
typedef union {
  byte Byte;
} TG0TVLSTR;
extern volatile TG0TVLSTR _TG0TVL @0x00000589;
#define TG0TVL                          _TG0TVL.Byte


/*** PTUCNTH - PTU Counter Register; 0x0000058E ***/
typedef union {
  byte Byte;
} PTUCNTHSTR;
extern volatile PTUCNTHSTR _PTUCNTH @0x0000058E;
#define PTUCNTH                         _PTUCNTH.Byte


/*** PTUCNTL - PTU Counter Register; 0x0000058F ***/
typedef union {
  byte Byte;
} PTUCNTLSTR;
extern volatile PTUCNTLSTR _PTUCNTL @0x0000058F;
#define PTUCNTL                         _PTUCNTL.Byte


/*** PTUPTRH - PTU Pointer Register; 0x00000591 ***/
typedef union {
  byte Byte;
} PTUPTRHSTR;
extern volatile PTUPTRHSTR _PTUPTRH @0x00000591;
#define PTUPTRH                         _PTUPTRH.Byte


/*** PTUPTRM - PTU Pointer Register; 0x00000592 ***/
typedef union {
  byte Byte;
} PTUPTRMSTR;
extern volatile PTUPTRMSTR _PTUPTRM @0x00000592;
#define PTUPTRM                         _PTUPTRM.Byte


/*** PTUPTRL - PTU Pointer Register; 0x00000593 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte PTUPTR      :7;                                       /* PTU Pointer */
  } Bits;
} PTUPTRLSTR;
extern volatile PTUPTRLSTR _PTUPTRL @0x00000593;
#define PTUPTRL                         _PTUPTRL.Byte
#define PTUPTRL_PTUPTR                  _PTUPTRL.Bits.PTUPTR

#define PTUPTRL_PTUPTR_MASK             254U
#define PTUPTRL_PTUPTR_BITNUM           1U


/*** TG0L0IDX - Trigger Generator 0 List 0 Index Register; 0x00000594 ***/
typedef union {
  byte Byte;
  struct {
    byte TG0L0IDX_grp :7;                                      /* Trigger Generator 0 List 0 Index */ /*Warning: group name is duplicated with register name*/
    byte             :1; 
  } Bits;
} TG0L0IDXSTR;
extern volatile TG0L0IDXSTR _TG0L0IDX @0x00000594;
#define TG0L0IDX                        _TG0L0IDX.Byte
#define TG0L0IDX_TG0L0IDX               _TG0L0IDX.Bits.TG0L0IDX_grp

#define TG0L0IDX_TG0L0IDX_MASK          127U
#define TG0L0IDX_TG0L0IDX_BITNUM        0U


/*** TG0L1IDX - Trigger Generator 0 List 1 Index Register; 0x00000595 ***/
typedef union {
  byte Byte;
  struct {
    byte TG0L1IDX_grp :7;                                      /* Trigger Generator 0 List 1 Index */ /*Warning: group name is duplicated with register name*/
    byte             :1; 
  } Bits;
} TG0L1IDXSTR;
extern volatile TG0L1IDXSTR _TG0L1IDX @0x00000595;
#define TG0L1IDX                        _TG0L1IDX.Byte
#define TG0L1IDX_TG0L1IDX               _TG0L1IDX.Bits.TG0L1IDX_grp

#define TG0L1IDX_TG0L1IDX_MASK          127U
#define TG0L1IDX_TG0L1IDX_BITNUM        0U


/*** PTUDEBUG - PTU Debug Register; 0x0000059F ***/
typedef union {
  byte Byte;
  struct {
    byte TG0FTE      :1;                                       /* Trigger Generator 0 Force Trigger Event */
    byte             :1; 
    byte PTUFRE      :1;                                       /* Force Reload event generation */
    byte             :1; 
    byte PTUT0PE     :1;                                       /* PTU PTUT0 Pin Enable */
    byte             :1; 
    byte PTUREPE     :1;                                       /* PTU PTURE Pin Enable */
    byte             :1; 
  } Bits;
} PTUDEBUGSTR;
extern volatile PTUDEBUGSTR _PTUDEBUG @0x0000059F;
#define PTUDEBUG                        _PTUDEBUG.Byte
#define PTUDEBUG_TG0FTE                 _PTUDEBUG.Bits.TG0FTE
#define PTUDEBUG_PTUFRE                 _PTUDEBUG.Bits.PTUFRE
#define PTUDEBUG_PTUT0PE                _PTUDEBUG.Bits.PTUT0PE
#define PTUDEBUG_PTUREPE                _PTUDEBUG.Bits.PTUREPE

#define PTUDEBUG_TG0FTE_MASK            1U
#define PTUDEBUG_PTUFRE_MASK            4U
#define PTUDEBUG_PTUT0PE_MASK           16U
#define PTUDEBUG_PTUREPE_MASK           64U


/*** TIM0TIOS - Timer Input Capture/Output Compare Select; 0x000005C0 ***/
typedef union {
  byte Byte;
  struct {
    byte IOS0        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 0 */
    byte IOS1        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpIOS  :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TIM0TIOSSTR;
